## Plan Result (sbox_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 18 to add, 2 to change, 17 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].time_rotating.rotate
* Update
  * module.logic[&#34;00&#34;].azurerm_logic_app_standard.this
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
* Replace
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.logic["00"].azurerm_logic_app_standard.this will be updated in-place
  ~ resource "azurerm_logic_app_standard" "this" {
        id                                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Web/sites/ingest00-logic-sbox"
        name                                     = "ingest00-logic-sbox"
        tags                                     = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
      - vnet_content_share_enabled               = true -> null
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-eventhub"] must be replaced
-/+ resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      ~ fqdns              = [
          - "Atlas-9be4da85-1798-4608-bee0-5f5232885d13.servicebus.windows.net",
        ] -> (known after apply)
      ~ id                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-sbox/managedVirtualNetworks/default/managedPrivateEndpoints/ingest00-runtimes-dataFactory001-purview-eventhub-sbox" -> (known after apply)
        name               = "ingest00-runtimes-dataFactory001-purview-eventhub-sbox"
      ~ target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-purview-sbox/providers/Microsoft.EventHub/namespaces/Atlas-9be4da85-1798-4608-bee0-5f5232885d13" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourcegroups/ingest-mgmt-purview-sbox/providers/Microsoft.EventHub/namespaces/Atlas-9be4da85-1798-4608-bee0-5f5232885d13" # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals["purview-eventhub"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "1091679101829064312" -> (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals["purview-storage-blob"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "2240946145915859894" -> (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals["purview-storage-queue"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "6334363122131431932" -> (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-eventhub"] must be replaced
-/+ resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      ~ fqdns              = [
          - "Atlas-9be4da85-1798-4608-bee0-5f5232885d13.servicebus.windows.net",
        ] -> (known after apply)
      ~ id                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox/managedVirtualNetworks/default/managedPrivateEndpoints/ingest00-integration-dataFactory001-purview-eventhub-sbox" -> (known after apply)
        name               = "ingest00-integration-dataFactory001-purview-eventhub-sbox"
      ~ target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-purview-sbox/providers/Microsoft.EventHub/namespaces/Atlas-9be4da85-1798-4608-bee0-5f5232885d13" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourcegroups/ingest-mgmt-purview-sbox/providers/Microsoft.EventHub/namespaces/Atlas-9be4da85-1798-4608-bee0-5f5232885d13" # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals["purview-eventhub"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "2545208604190614221" -> (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals["purview-storage-blob"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "510457879382728497" -> (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals["purview-storage-queue"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "711495041665461351" -> (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
        name                               = "ingest00curatedsbox"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ default_action             = "Allow" -> "Deny"
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["landing"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 24 -> (known after apply)
      ~ hour    = 14 -> (known after apply)
      ~ id      = "2025-02-24T14:01:26Z" -> (known after apply)
      ~ minute  = 1 -> (known after apply)
      ~ month   = 2 -> (known after apply)
      ~ rfc3339 = "2025-02-24T14:01:26Z" -> (known after apply) # forces replacement
      ~ second  = 26 -> (known after apply)
      ~ unix    = 1740405686 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["01"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-eventhub"] must be replaced
-/+ resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      ~ fqdns              = [
          - "Atlas-9be4da85-1798-4608-bee0-5f5232885d13.servicebus.windows.net",
        ] -> (known after apply)
      ~ id                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.DataFactory/factories/ingest01-runtimes-dataFactory001-sbox/managedVirtualNetworks/default/managedPrivateEndpoints/ingest01-runtimes-dataFactory001-purview-eventhub-sbox" -> (known after apply)
        name               = "ingest01-runtimes-dataFactory001-purview-eventhub-sbox"
      ~ target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-purview-sbox/providers/Microsoft.EventHub/namespaces/Atlas-9be4da85-1798-4608-bee0-5f5232885d13" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourcegroups/ingest-mgmt-purview-sbox/providers/Microsoft.EventHub/namespaces/Atlas-9be4da85-1798-4608-bee0-5f5232885d13" # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["01"].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals["purview-eventhub"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "2646387855496440121" -> (known after apply)
    }

  # module.data_landing_zone["01"].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals["purview-storage-blob"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "3764540337929475685" -> (known after apply)
    }

  # module.data_landing_zone["01"].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals["purview-storage-queue"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "3827704496266290216" -> (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants["purview-eventhub"] must be replaced
-/+ resource "azurerm_data_factory_managed_private_endpoint" "dependants" {
      ~ fqdns              = [
          - "Atlas-9be4da85-1798-4608-bee0-5f5232885d13.servicebus.windows.net",
        ] -> (known after apply)
      ~ id                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.DataFactory/factories/ingest01-integration-dataFactory001-sbox/managedVirtualNetworks/default/managedPrivateEndpoints/ingest01-integration-dataFactory001-purview-eventhub-sbox" -> (known after apply)
        name               = "ingest01-integration-dataFactory001-purview-eventhub-sbox"
      ~ target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-purview-sbox/providers/Microsoft.EventHub/namespaces/Atlas-9be4da85-1798-4608-bee0-5f5232885d13" -> "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourcegroups/ingest-mgmt-purview-sbox/providers/Microsoft.EventHub/namespaces/Atlas-9be4da85-1798-4608-bee0-5f5232885d13" # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["01"].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals["purview-eventhub"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "8374994542655221852" -> (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals["purview-storage-blob"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "5801816259055979079" -> (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals["purview-storage-queue"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "dependant_private_endpoint_approvals" {
      ~ id = "3408568039825268312" -> (known after apply)
    }

Plan: 18 to add, 2 to change, 17 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone["00"].module.storage["landing"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-03-01T14:01:26Z"
      - rotation_rfc3339 = "2025-02-24T14:01:26Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":65,"Program":"tfcmt","SHA1":"","Target":"sbox_landing - TerraformPlanApply","Vars":{}} -->